tutorials/rheoEFoam/EEI/PoissonBoltzmann/CrossSlot/0/C.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_top
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    
    inlet_down
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    outlet_left
    {
        type            zeroGradient;
    }

    outlet_right
    {
        type            zeroGradient;
    }
    
    "(top|base)"
    {
        type            empty;
    }
}

// ************************************************************************* //
