tutorials/rheoEFoam/EEI/PoissonBoltzmann/CrossSlot/0/tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{

    sym 
    {
    
    type            symmetryPlane;
     
    }

    inlet_top
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    inlet_down
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }

    walls
    {
        type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
    }
    
    outlet_left
    {
         type            zeroGradient;
    }
    
    outlet_right
    {
        type            zeroGradient;
    }
    
    "(top|base)"
    {
        type            empty;
    }
}

// ************************************************************************* //
